/*Напишите программу, которая будет принимать
 на вход число и возвращать сумму его цифр.*/ 

int SumOfDigits(int n)
{
    if(n >= 10)            // 54321 (% 10) 5432
    {
        return n % 10 + SumOfDigits(n / 10);
    }
    else return n;
}

Console.WriteLine(SumOfDigits(12346));
//==================================================================================================================
